tap "dashlane/tap"
tap "homebrew/cask-fonts"
tap "kreuzwerker/taps"

# Apps
cask "alfred"
cask "amazon-chime"
cask "arc"
# cask "discord"
cask "gitkraken"
cask "google-chrome", force: true
cask "hoppscotch"
cask "logi-options-plus"
cask "meetingbar"
cask "microsoft-teams", force: true
cask "notion"
cask "obsidian"
# cask "plex"
cask "slack", force: true
# cask "spotify" # disabled to keep the premium patch
# cask "stremio"
cask "tableplus"
cask "visual-studio-code"
cask "warp"
cask "zoom"

# AWS
brew "awscli"
brew "cfn-lint"
cask "session-manager-plugin"
brew "serverless"

# Docker
cask "docker"
cask "docker-compose"
brew "docker-credential-helper-ecr"

# Fonts
cask "font-jetbrains-mono"

# Git
brew "act"
brew "actionlint"
brew "git"
brew "git-lfs"
brew "gh"
brew "pre-commit"

# Microsoft Office
cask "microsoft-excel", force: true
cask "microsoft-outlook", force: true
cask "microsoft-powerpoint", force: true
cask "microsoft-word", force: true

# Misc
brew "base64"
brew "bash"
brew "coreutils"
brew "dashlane-cli"
brew "fzf"
brew "gcc"
brew "go"
brew "gnupg"
brew "jq"
brew "localstack"
brew "markdownlint-cli"
brew "pinentry-mac"
brew "shellcheck"
brew "telnet"
brew "vim"
brew "watch"
brew "wget"
brew "yq"
brew "zsh"

# Node JS
brew "nvm"

# PHP
brew "php"
brew "composer"

# Terraform
brew "checkov"
brew "infracost"
brew "terraform-docs"
brew "terrascan"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tgenv"
brew "m1-terraform-provider-helper"
brew "trivy"












# Chatloop
tap "homebrew/bundle"
tap "homebrew/cask-versions"

brew "awscli"
brew "bash"
brew "cocoapods"
brew "composer"
brew "dnsmasq"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "gum"
brew "imagemagick"
brew "jq"
brew "librsvg"
brew "mas"
brew "nvm"
brew "openjdk@17"
brew "php@8.1", link: true
brew "pre-commit"
brew "ruby"
brew "sponge"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "yq"

cask "1password", force: true
cask "1password-cli", force: true
cask "android-studio", force: true
cask "aws-vault", force: true
cask "docker", force: true
cask "google-chrome", force: true
cask "iterm2", force: true
cask "microsoft-teams", force: true
cask "rectangle", force: true
cask "slack", force: true

# mas 'XCode', id: 497799835
