
# tap repositories and their packages

tap 'homebrew/cask-fonts'

tap 'dashlane/tap'
brew 'dashlane-cli'

tap 'kreuzwerker/taps'

tap 'rcmdnk/file'
brew 'brew-file'

# Other Homebrew packages
brew 'acl'
brew 'act'
brew 'actionlint'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argon2'
brew 'aspell'
brew 'attr'
brew 'autoconf'
brew 'awscli'
brew 'base64'
brew 'bash'
brew 'berkeley-db@5'
brew 'binutils'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'cffi'
brew 'cfn-lint'
brew 'checkov'
brew 'composer'
brew 'coreutils'
brew 'curl'
brew 'dbus'
brew 'docutils'
brew 'expat'
brew 'fontconfig'
brew 'freetds'
brew 'freetype'
brew 'fzf'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'giflib'
brew 'git'
brew 'git-lfs'
brew 'glib'
brew 'gmp'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'highway'
brew 'icu4c'
brew 'imath'
brew 'infracost'
brew 'isl'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'krb5'
brew 'libassuan'
brew 'libavif'
brew 'libcap'
brew 'libevent'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn2'
brew 'libksba'
brew 'libmpc'
brew 'libnghttp2'
brew 'libnsl'
brew 'libpng'
brew 'libpq'
brew 'libsecret'
brew 'libsodium'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtirpc'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvmaf'
brew 'libxcrypt'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'localstack'
brew 'lua'
brew 'lz4'
brew 'm1-terraform-provider-helper'
brew 'm4'
brew 'markdownlint-cli'
brew 'mawk'
brew 'mpdecimal'
brew 'mpfr'
brew 'ncurses'
brew 'nettle'
brew 'node'
brew 'npth'
brew 'numpy'
brew 'nvm'
brew 'oniguruma'
brew 'openblas'
brew 'openexr'
brew 'openldap'
brew 'openssl@3'
brew 'p11-kit'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'php'
brew 'pinentry'
brew 'pre-commit'
brew 'pycparser'
brew 'pygments'
brew 'python-argcomplete'
brew 'python-attrs'
brew 'python-certifi'
brew 'python-click'
brew 'python-cryptography'
brew 'python-dateutil'
brew 'python-distlib'
brew 'python-filelock'
brew 'python-jinja'
brew 'python-markdown'
brew 'python-markupsafe'
brew 'python-mpmath'
brew 'python-networkx'
brew 'python-packaging'
brew 'python-pbr'
brew 'python-platformdirs'
brew 'python-psutil'
brew 'python-pyparsing'
brew 'python-setuptools'
brew 'python-sympy'
brew 'python-tabulate'
brew 'python-toml'
brew 'python-typing-extensions'
brew 'python-urllib3'
brew 'python@3.11'
brew 'python@3.12'
brew 'pyyaml'
brew 'readline'
brew 'rtmpdump'
brew 'ruby'
brew 'serverless'
brew 'shellcheck'
brew 'six'
brew 'sqlite'
brew 'systemd'
brew 'terraform-docs'
brew 'terrascan'
brew 'tfenv'
brew 'tflint'
brew 'tfsec'
brew 'tgenv'
brew 'tidy-html5'
brew 'trivy'
brew 'unbound'
brew 'unixodbc'
brew 'util-linux'
brew 'vim'
brew 'virtualenv'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'xz'
brew 'yq'
brew 'zsh'
brew 'zstd'

# Additional files
file './Brewfile.$PLATFORM'
file './Brewfile.$HOSTNAME'
